<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"45a73440a0ccb5c5a2319277c8a3ead0b4542acd003a3bfb06176c0e94c8ee99","plan_job_ref":"Job Tests for PRs #359 at https://github.com/GSA-TTS/FAC/actions/runs/5137054957","plan_hash":"63acb4bb67f7812376b8c9cff83bb9e5e6fc318e460730b711ec9d27f94b87f5","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 11 to add, 0 to change, 7 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.staging.module.egress-proxy.cloudfoundry_app.egress_app will be destroyed
  # (because cloudfoundry_app.egress_app is not in configuration)
  - resource "cloudfoundry_app" "egress_app" {
      - buildpack                       = "binary_buildpack" -> null
      - command                         = "./caddy run --config Caddyfile" -> null
      - disk_quota                      = 1024 -> null
      - enable_ssh                      = true -> null
      - environment                     = (sensitive value) -> null
      - health_check_invocation_timeout = 0 -> null
      - health_check_timeout            = 0 -> null
      - health_check_type               = "port" -> null
      - id                              = "eae27483-7562-4fcc-be48-6b80b8c47816" -> null
      - id_bg                           = "eae27483-7562-4fcc-be48-6b80b8c47816" -> null
      - instances                       = 1 -> null
      - memory                          = 64 -> null
      - name                            = "egress" -> null
      - path                            = "../shared/modules/egress-proxy/proxy.zip" -> null
      - ports                           = [
          - 8080,
        ] -> null
      - source_code_hash                = "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4" -> null
      - space                           = "c743dc94-8167-40c7-a486-3a10424a97c6" -> null
      - stack                           = "cflinuxfs4" -> null
      - stopped                         = false -> null
      - strategy                        = "rolling" -> null
      - timeout                         = 60 -> null

      - routes {
          - port  = 8080 -> null
          - route = "ba600f87-6f4d-42ac-aad7-c9bd5b35a029" -> null
        }
    }

  # module.staging.module.egress-proxy.cloudfoundry_network_policy.client_routing["fac-av-staging"] will be destroyed
  # (because cloudfoundry_network_policy.client_routing is not in configuration)
  - resource "cloudfoundry_network_policy" "client_routing" {
      - id = "a7979ef2-7b46-9159-b5aa-d537e865df3e" -> null

      - policy {
          - destination_app = "eae27483-7562-4fcc-be48-6b80b8c47816" -> null
          - port            = "61443" -> null
          - protocol        = "tcp" -> null
          - source_app      = "d1bea029-d2d3-4b68-b16d-b216bcaea573" -> null
        }
    }

  # module.staging.module.egress-proxy.cloudfoundry_network_policy.client_routing["gsa-fac"] will be destroyed
  # (because cloudfoundry_network_policy.client_routing is not in configuration)
  - resource "cloudfoundry_network_policy" "client_routing" {
      - id = "48ca263c-6602-4f05-5233-4eccf3f98615" -> null

      - policy {
          - destination_app = "eae27483-7562-4fcc-be48-6b80b8c47816" -> null
          - port            = "61443" -> null
          - protocol        = "tcp" -> null
          - source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857" -> null
        }
    }

  # module.staging.module.egress-proxy.cloudfoundry_route.egress_route will be destroyed
  # (because cloudfoundry_route.egress_route is not in configuration)
  - resource "cloudfoundry_route" "egress_route" {
      - domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> null
      - endpoint = "gsa-tts-oros-fac-staging-egress-egress.apps.internal" -> null
      - hostname = "gsa-tts-oros-fac-staging-egress-egress" -> null
      - id       = "ba600f87-6f4d-42ac-aad7-c9bd5b35a029" -> null
      - space    = "c743dc94-8167-40c7-a486-3a10424a97c6" -> null
    }

  # module.staging.module.egress-proxy.cloudfoundry_user_provided_service.credentials will be destroyed
  # (because cloudfoundry_user_provided_service.credentials is not in configuration)
  - resource "cloudfoundry_user_provided_service" "credentials" {
      - credentials = (sensitive value) -> null
      - id          = "08e88973-c2f3-4822-88bb-93f1995a8368" -> null
      - name        = "egress-creds" -> null
      - space       = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807" -> null
      - tags        = [] -> null
    }

  # module.staging.module.egress-proxy.random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.staging.module.egress-proxy.random_uuid.username will be destroyed
  # (because random_uuid.username is not in configuration)
  - resource "random_uuid" "username" {
      - id     = "b56a3103-2956-a125-2ac0-b35f44c9259b" -> null
      - result = "b56a3103-2956-a125-2ac0-b35f44c9259b" -> null
    }

  # module.staging.module.https-proxy.cloudfoundry_app.egress_app will be created
  + resource "cloudfoundry_app" "egress_app" {
      + buildpack                       = "binary_buildpack"
      + command                         = "./caddy run --config Caddyfile"
      + disk_quota                      = (known after apply)
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 64
      + name                            = "https-proxy"
      + path                            = "../shared/modules/https-proxy/proxy.zip"
      + ports                           = (known after apply)
      + source_code_hash                = "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4"
      + space                           = "c743dc94-8167-40c7-a486-3a10424a97c6"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.staging.module.https-proxy.cloudfoundry_network_policy.client_routing["fac-av-staging"] will be created
  + resource "cloudfoundry_network_policy" "client_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "d1bea029-d2d3-4b68-b16d-b216bcaea573"
        }
    }

  # module.staging.module.https-proxy.cloudfoundry_network_policy.client_routing["gsa-fac"] will be created
  + resource "cloudfoundry_network_policy" "client_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857"
        }
    }

  # module.staging.module.https-proxy.cloudfoundry_route.egress_route will be created
  + resource "cloudfoundry_route" "egress_route" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "gsa-tts-oros-fac-staging-egress-https-proxy"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "c743dc94-8167-40c7-a486-3a10424a97c6"
    }

  # module.staging.module.https-proxy.cloudfoundry_user_provided_service.credentials will be created
  + resource "cloudfoundry_user_provided_service" "credentials" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "https-proxy-creds"
      + space       = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # module.staging.module.https-proxy.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.staging.module.https-proxy.random_uuid.username will be created
  + resource "random_uuid" "username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.staging.module.smtp-proxy.cloudfoundry_app.egress_app will be created
  + resource "cloudfoundry_app" "egress_app" {
      + buildpack                       = "nginx_buildpack"
      + disk_quota                      = (known after apply)
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 64
      + name                            = "smtp-proxy"
      + path                            = "../shared/modules/stream-proxy/proxy.zip"
      + ports                           = (known after apply)
      + source_code_hash                = "e60fde86b7b0b2dd8316d9e3a73e1b7b03a50a0a311c851a7cbb7d8b84689206"
      + space                           = "c743dc94-8167-40c7-a486-3a10424a97c6"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.staging.module.smtp-proxy.cloudfoundry_network_policy.client_routing["gsa-fac"] will be created
  + resource "cloudfoundry_network_policy" "client_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "8080"
          + protocol        = "tcp"
          + source_app      = "38f7f948-e7b4-4e8f-8ff4-7c89213ad857"
        }
    }

  # module.staging.module.smtp-proxy.cloudfoundry_route.egress_route will be created
  + resource "cloudfoundry_route" "egress_route" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "gsa-tts-oros-fac-staging-egress-smtp-proxy"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "c743dc94-8167-40c7-a486-3a10424a97c6"
    }

  # module.staging.module.smtp-proxy.cloudfoundry_user_provided_service.credentials will be created
  + resource "cloudfoundry_user_provided_service" "credentials" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "smtp-proxy-creds"
      + space       = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

Plan: 11 to add, 0 to change, 7 to destroy.
```
</details>

:memo: Plan generated in [Tests for PRs #359](https://github.com/GSA-TTS/FAC/actions/runs/5137054957)